### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [8]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import pprint as pprint

# File to Load
file_to_load = "../Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
clean_purchase_data = purchase_data.drop_duplicates(subset=['SN'])
SN = len(clean_purchase_data['SN'])
print(f'Total Players:', [SN])

Total Players: [576]

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
unique_items = len(pd.unique(purchase_data['Item Name']))
avg_price = round(purchase_data["Price"].mean(), 2)
purchases = len(purchase_data['Purchase ID'])
total_revenue = purchase_data["Price"].sum()

In [5]:
results = {
    'Unique Items': [unique_items],
    'Average Price': [avg_price],
    'Purchases': [purchases],
    'Total Revenue ($)': [total_revenue]}

results_df = pd.DataFrame(results)
results_df

   Unique Items  Average Price  Purchases  Total Revenue ($)
0           179           3.05        780            2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [7]:
gender_count = purchase_data['Gender'].value_counts()

In [8]:
# Percentage calculation
gender_percent = round((purchase_data['Gender'].value_counts()/purchase_data['Gender'].count())*100, 2)
gender_percent

Male                     83.59
Female                   14.49
Other / Non-Disclosed     1.92
Name: Gender, dtype: float64

In [9]:
gender_demo = {
    'Total Count': gender_count,
    'Percentage of Players (%)': gender_percent
}
gender_demo

{'Total Count': Male                     652
 Female                   113
 Other / Non-Disclosed     15
 Name: Gender, dtype: int64,
 'Percentage of Players (%)': Male                     83.59
 Female                   14.49
 Other / Non-Disclosed     1.92
 Name: Gender, dtype: float64}

In [10]:
gender_df = pd.DataFrame(gender_demo)
gender_df

                       Total Count  Percentage of Players (%)
Male                           652                      83.59
Female                         113                      14.49
Other / Non-Disclosed           15                       1.92


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
purchase_gender = purchase_data[['Purchase ID', 'Gender']]
purchase_gender_count = purchase_gender.groupby('Gender').count()
purchase_gender_count

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [45]:
price_gender = round(purchase_data[['Gender', 'Price']].groupby('Gender').mean(), 2)
price_gender = price_gender.rename(columns={"Price": "Avg. Purchase Price ($)"})
price_gender_df = pd.DataFrame(price_gender)
price_gender_df

                       Avg. Purchase Price ($)
Gender
Female                                    3.20
Male                                      3.02
Other / Non-Disclosed                     3.35

In [29]:
total_gender = purchase_data[['Gender', 'Price']].groupby('Gender').sum()
total_gender = total_gender.rename(columns={"Price": "Purchase Total ($)"})
total_gender_df = pd.DataFrame(total_gender)
total_gender_df

                       Purchase Total ($)
Gender
Female                             361.94
Male                              1967.64
Other / Non-Disclosed               50.19

In [43]:
purchasing_df = pd.DataFrame(purchase_gender_count)
purchasing_df

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [44]:
purchasing_df = purchasing_df.append(total_gender_df, ignore_index=True)
purchasing_df

   Purchase ID  Purchase Total ($)
0        113.0                 NaN
1        652.0                 NaN
2         15.0                 NaN
3          NaN              361.94
4          NaN             1967.64
5          NaN               50.19

In [46]:
purchasing_df = purchasing_df.append(price_gender_df, ignore_index=True)
purchasing_df

   Purchase ID  Purchase Total ($)  Avg. Purchase Price ($)
0        113.0                 NaN                      NaN
1        652.0                 NaN                      NaN
2         15.0                 NaN                      NaN
3          NaN              361.94                      NaN
4          NaN             1967.64                      NaN
5          NaN               50.19                      NaN
6          NaN                 NaN                     3.20
7          NaN                 NaN                     3.02
8          NaN                 NaN                     3.35

In [55]:
purchasing_df = purchasing_df.rename(columns={"Purchase ID": "Purchase Count"})
purchasing_df

   Purchase Count  Purchase Total ($)  Avg. Purchase Price ($)
0           113.0                 NaN                      NaN
1           652.0                 NaN                      NaN
2            15.0                 NaN                      NaN
3             NaN              361.94                      NaN
4             NaN             1967.64                      NaN
5             NaN               50.19                      NaN
6             NaN                 NaN                     3.20
7             NaN                 NaN                     3.02
8             NaN                 NaN                     3.35

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [3]:
# Create the bins in which Data will be held
bins = [0, 9, 14, 19, 24, 29, 34, 40]

# Create the names for the five bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "40+"]

In [58]:
age_demo = purchase_data['Age']
age_demo_df = pd.DataFrame(age_demo)
age_demo_df

     Age
0     20
1     40
2     24
3     24
4     23
..   ...
775   21
776   21
777   20
778    7
779   24

[780 rows x 1 columns]

In [59]:
age_demo_df["Age Category"] = pd.cut(age_demo_df["Age"], bins, labels=group_names, include_lowest=True) # inlclude_lowest=False is default, and it means left-include 1st interval or not
# age_demo_df = age_demo_df.set_index('Age Category')
age_demo_df

     Age Age Category
0     20        20-24
1     40          40+
2     24        20-24
3     24        20-24
4     23        20-24
..   ...          ...
775   21        20-24
776   21        20-24
777   20        20-24
778    7          <10
779   24        20-24

[780 rows x 2 columns]

In [60]:
age_demo_df = age_demo_df.groupby('Age Category').count()
age_demo_df

              Age
Age Category
<10            23
10-14          28
15-19         136
20-24         365
25-29         101
30-34          73
40+            47

In [61]:
age_demo_df = age_demo_df.rename(columns={"Age": "Total Count"})
age_demo_df

              Total Count
Age Category
<10                    23
10-14                  28
15-19                 136
20-24                 365
25-29                 101
30-34                  73
40+                    47

In [62]:
age_demo_df['Percentage of Players'] = (age_demo_df['Total Count'] / len(purchase_data['Age']) * 100)
age_demo_df

              Total Count  Percentage of Players
Age Category
<10                    23               2.948718
10-14                  28               3.589744
15-19                 136              17.435897
20-24                 365              46.794872
25-29                 101              12.948718
30-34                  73               9.358974
40+                    47               6.025641

In [63]:
age_demo_df = age_demo_df.round({'Percentage of Players': 2})
age_demo_df

              Total Count  Percentage of Players
Age Category
<10                    23                   2.95
10-14                  28                   3.59
15-19                 136                  17.44
20-24                 365                  46.79
25-29                 101                  12.95
30-34                  73                   9.36
40+                    47                   6.03

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [9]:
purchase_data["Age Category"] = pd.cut(purchase_data["Age"], bins, labels=group_names, include_lowest=True)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [20]:
purchase_age_df = purchase_data[['Age Category', 'Purchase ID']]
purchase_age_df = purchase_age_df.groupby('Age Category').count()
purchase_age_df = purchase_age_df.rename(columns={"Purchase ID": "Purchase Count"})
purchase_age_df

              Purchase Count
Age Category
<10                       23
10-14                     28
15-19                    136
20-24                    365
25-29                    101
30-34                     73
40+                       47

In [21]:
avg_purchase_age_df = purchase_data[['Age Category', 'Price']]
avg_purchase_age_df = avg_purchase_age_df.groupby('Age Category').mean()
avg_purchase_age_df = avg_purchase_age_df.rename(columns={"Price": "Average Price ($)"})
avg_purchase_age_df = avg_purchase_age_df.round({'Average Price ($)': 2})
avg_purchase_age_df

              Average Price ($)
Age Category
<10                        3.35
10-14                      2.96
15-19                      3.04
20-24                      3.05
25-29                      2.90
30-34                      2.93
40+                        3.50

In [23]:
total_purchase_age_df = purchase_data[['Age Category', 'Price']]
total_purchase_age_df = total_purchase_age_df.groupby('Age Category').sum()
total_purchase_age_df = total_purchase_age_df.rename(columns={"Price": "Total Purchase Price ($)"})
total_purchase_age_df = total_purchase_age_df.round({'Total Purchase Price ($)': 2})
total_purchase_age_df

              Total Purchase Price ($)
Age Category
<10                              77.13
10-14                            82.78
15-19                           412.89
20-24                          1114.06
25-29                           293.00
30-34                           214.00
40+                             164.38

In [27]:
combined_df = pd.concat([purchase_age_df, avg_purchase_age_df, total_purchase_age_df], axis=1).reindex(purchase_age_df.index)
combined_df

              Purchase Count  Average Price ($)  Total Purchase Price ($)
Age Category
<10                       23               3.35                     77.13
10-14                     28               2.96                     82.78
15-19                    136               3.04                    412.89
20-24                    365               3.05                   1114.06
25-29                    101               2.90                    293.00
30-34                     73               2.93                    214.00
40+                       47               3.50                    164.38

In [36]:
combined_df['Avg Total Purchase per Person ($)'] = (combined_df['Total Purchase Price ($)'].mean() / combined_df['Purchase Count'])
combined_df = combined_df.round({'Avg Total Purchase per Person ($)': 2})
combined_df

,Purchase Count,Average Price ($),Total Purchase Price ($),Avg Total Purchase per Person ($)
Age Category,,,,
<10,23,3.35,77.13,14.65
10-14,28,2.96,82.78,12.03
15-19,136,3.04,412.89,2.48
20-24,365,3.05,1114.06,0.92
25-29,101,2.90,293.00,3.34
30-34,73,2.93,214.00,4.61
40+,47,3.50,164.38,7.17

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [62]:
top_spenders = purchase_data[['SN', 'Price']]
top_spenders

                SN  Price
0          Lisim78   3.53
1      Lisovynya38   1.56
2       Ithergue48   4.88
3    Chamassasya86   3.27
4        Iskosia90   1.44
..             ...    ...
775     Aethedru70   3.54
776         Iral74   1.63
777     Yathecal72   3.46
778        Sisur91   4.19
779      Ennrian78   4.60

[780 rows x 2 columns]

In [65]:
top_spenders = top_spenders.groupby('SN').sum()
top_spenders = top_spenders.rename(columns={"Price": "Total Purchase Value ($)"})

top_spenders

               Total Purchase Value ($)
SN
Adairialis76                       2.28
Adastirin33                        4.48
Aeda94                             4.91
Aela59                             4.32
Aelaria33                          1.79
...                                 ...
Yathecal82                         6.22
Yathedeu43                         6.02
Yoishirrala98                      4.58
Zhisrisu83                         7.89
Zontibe81                          8.03

[576 rows x 1 columns]

In [64]:
purchase_count_spenders = purchase_data[['SN', 'Purchase ID']]
purchase_count_spenders = purchase_count_spenders.groupby('SN').count()
purchase_count_spenders = purchase_count_spenders.sort_values(by='Purchase ID', ascending=False)
purchase_count_spenders = purchase_count_spenders.rename(columns={"Purchase ID": "Purchase Count"})

purchase_count_spenders

              Purchase Count
SN
Lisosia93                  5
Iral74                     4
Idastidru52                4
Asur53                     3
Inguron55                  3
...                      ...
Hala31                     1
Haisurra41                 1
Hailaphos89                1
Haestyphos66               1
Iskosian40                 1

[576 rows x 1 columns]

In [67]:
avg_purchase_spenders = purchase_data[['SN', 'Price']]
avg_purchase_spenders = avg_purchase_spenders.groupby('SN').mean()
avg_purchase_spenders = avg_purchase_spenders.rename(columns={"Price": "Average Purchase Price ($)"})
avg_purchase_spenders = avg_purchase_spenders.round({'Average Purchase Price ($)': 2})

avg_purchase_spenders

               Average Purchase Price ($)
SN
Adairialis76                         2.28
Adastirin33                          4.48
Aeda94                               4.91
Aela59                               4.32
Aelaria33                            1.79
...                                   ...
Yathecal82                           2.07
Yathedeu43                           3.01
Yoishirrala98                        4.58
Zhisrisu83                           3.94
Zontibe81                            2.68

[576 rows x 1 columns]

In [68]:
combined_top_spenders = pd.concat([purchase_count_spenders, avg_purchase_spenders, top_spenders], axis=1).reindex(top_spenders.index)
combined_top_spenders

,Purchase Count,Average Purchase Price ($),Total Purchase Value ($)
SN,,,
Adairialis76,1,2.28,2.28
Adastirin33,1,4.48,4.48
Aeda94,1,4.91,4.91
Aela59,1,4.32,4.32
Aelaria33,1,1.79,1.79
...,...,...,...
Yathecal82,3,2.07,6.22
Yathedeu43,2,3.01,6.02
Yoishirrala98,1,4.58,4.58
Zhisrisu83,2,3.94,7.89
Zontibe81,3,2.68,8.03

In [71]:
combined_top_spenders = combined_top_spenders.sort_values(by='Total Purchase Value ($)', ascending=False)
combined_top_spenders

,Purchase Count,Average Purchase Price ($),Total Purchase Value ($)
SN,,,
Lisosia93,5,3.79,18.96
Idastidru52,4,3.86,15.45
Chamjask73,3,4.61,13.83
Iral74,4,3.40,13.62
Iskadarya95,3,4.37,13.10
...,...,...,...
Irilis75,1,1.02,1.02
Hala31,1,1.02,1.02
Aidai61,1,1.01,1.01
Chanirra79,1,1.01,1.01
Alo38,1,1.00,1.00

In [72]:
combined_top_spenders = combined_top_spenders.head(5)
combined_top_spenders

,Purchase Count,Average Purchase Price ($),Total Purchase Value ($)
SN,,,
Lisosia93,5,3.79,18.96
Idastidru52,4,3.86,15.45
Chamjask73,3,4.61,13.83
Iral74,4,3.40,13.62
Iskadarya95,3,4.37,13.10

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [73]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [105]:
most_popular_items = purchase_data[['Item ID', 'Price']]
most_popular_items = most_popular_items.groupby('Item ID').sum()
most_popular_items = most_popular_items.rename(columns={"Price": "Total Purchase Value ($)"})

# most_popular_items['Total Purchase Value ($)'] = most_popular_items.loc('Item Name').sum()
most_popular_items

         Total Purchase Value ($)
Item ID
0                            5.12
1                           11.77
2                           14.88
3                           14.94
4                            8.50
...                           ...
178                         50.76
179                         26.88
181                          8.30
182                         12.09
183                          3.27

[179 rows x 1 columns]

In [91]:
items = purchase_data[['Item ID', 'Item Name', 'Price']]
items = items.rename(columns={"Price": "Item Price ($)"})

items = items.drop_duplicates(subset=['Item ID'])

items

     Item ID                                  Item Name  Item Price ($)
0        108  Extraction, Quickblade Of Trembling Hands            3.53
1        143                          Frenzied Scimitar            1.56
2         92                               Final Critic            4.88
3        100                                Blindscythe            3.27
4        131                                       Fury            1.44
..       ...                                        ...             ...
664       47                Alpha, Reach of Ending Hope            3.58
673      130                                      Alpha            2.07
700       90                                   Betrayer            2.94
717      177   Winterthorn, Defender of Shifting Worlds            2.08
727      104                         Gladiator's Glaive            1.93

[179 rows x 3 columns]

In [93]:
items_count = purchase_data[['Item ID', 'Purchase ID']]
items_count = items_count.rename(columns={"Purchase ID": "Purchase Count"})

items_count = items_count.groupby('Item ID').count()
items_count

         Purchase Count
Item ID
0                     4
1                     4
2                     6
3                     6
4                     5
...                 ...
178                  12
179                   6
181                   5
182                   3
183                   3

[179 rows x 1 columns]

In [106]:
most_popular_items = pd.concat([items, items_count, most_popular_items], axis=1).reindex(items.index)
most_popular_items

,Item ID,Item Name,Item Price ($),Purchase Count,Total Purchase Value ($)
0,108.0,"Extraction, Quickblade Of Trembling Hands",3.53,4.0,5.12
1,143.0,Frenzied Scimitar,1.56,4.0,11.77
2,92.0,Final Critic,4.88,6.0,14.88
3,100.0,Blindscythe,3.27,6.0,14.94
4,131.0,Fury,1.44,5.0,8.50
...,...,...,...,...,...
664,47.0,"Alpha, Reach of Ending Hope",3.58,NaN,NaN
673,130.0,Alpha,2.07,NaN,NaN
700,90.0,Betrayer,2.94,NaN,NaN
717,177.0,"Winterthorn, Defender of Shifting Worlds",2.08,NaN,NaN
727,104.0,Gladiator's Glaive,1.93,NaN,NaN

In [107]:
most_popular_items = most_popular_items.sort_values(by='Purchase Count', ascending=False)
most_popular_items

,Item ID,Item Name,Item Price ($),Purchase Count,Total Purchase Value ($)
92,39.0,"Betrayal, Whisper of Grieving Widows",3.94,13.0,59.99
145,46.0,Hopeless Ebon Dualblade,1.33,9.0,41.22
132,145.0,Fiery Glass Crusader,4.58,9.0,28.99
108,85.0,Malificent Bag,1.75,9.0,31.77
37,73.0,Ritual Mace,2.05,8.0,25.28
...,...,...,...,...,...
664,47.0,"Alpha, Reach of Ending Hope",3.58,NaN,NaN
673,130.0,Alpha,2.07,NaN,NaN
700,90.0,Betrayer,2.94,NaN,NaN
717,177.0,"Winterthorn, Defender of Shifting Worlds",2.08,NaN,NaN
727,104.0,Gladiator's Glaive,1.93,NaN,NaN

In [108]:
most_popular_items = most_popular_items.head(5)
most_popular_items

,Item ID,Item Name,Item Price ($),Purchase Count,Total Purchase Value ($)
92,39.0,"Betrayal, Whisper of Grieving Widows",3.94,13.0,59.99
145,46.0,Hopeless Ebon Dualblade,1.33,9.0,41.22
132,145.0,Fiery Glass Crusader,4.58,9.0,28.99
108,85.0,Malificent Bag,1.75,9.0,31.77
37,73.0,Ritual Mace,2.05,8.0,25.28

In [109]:
most_popular_items = most_popular_items.set_index('Item ID')
most_popular_items

,Item Name,Item Price ($),Purchase Count,Total Purchase Value ($)
Item ID,,,,
39.0,"Betrayal, Whisper of Grieving Widows",3.94,13.0,59.99
46.0,Hopeless Ebon Dualblade,1.33,9.0,41.22
145.0,Fiery Glass Crusader,4.58,9.0,28.99
85.0,Malificent Bag,1.75,9.0,31.77
73.0,Ritual Mace,2.05,8.0,25.28

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80